In [1]:
# importing the neccessary dependencies
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# reading the csv file into a pandas dataframe
df=pd.read_csv(r"C:\Users\joshua\Downloads\retail_sales_dataset.csv")

In [3]:
# viewing the first five rows
df.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100

In [4]:
# viewing the last five rows 
df.tail()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
995,996,2023-05-16,CUST996,Male,62,Clothing,1,50,50
996,997,2023-11-17,CUST997,Male,52,Beauty,3,30,90
997,998,2023-10-29,CUST998,Female,23,Beauty,4,25,100
998,999,2023-12-05,CUST999,Female,36,Electronics,3,50,150
999,1000,2023-04-12,CUST1000,Male,47,Electronics,4,30,120

In [5]:
# shape of the dataset
df.shape

(1000, 9)

The dataset has 1000 rows and 9 columns

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Date              1000 non-null   object
 2   Customer ID       1000 non-null   object
 3   Gender            1000 non-null   object
 4   Age               1000 non-null   int64
 5   Product Category  1000 non-null   object
 6   Quantity          1000 non-null   int64
 7   Price per Unit    1000 non-null   int64
 8   Total Amount      1000 non-null   int64
dtypes: int64(5), object(4)
memory usage: 70.4+ KB

Incorrect datatype for the Date column

In [7]:
df.describe()

       Transaction ID         Age     Quantity  Price per Unit  Total Amount
count     1000.000000  1000.00000  1000.000000     1000.000000   1000.000000
mean       500.500000    41.39200     2.514000      179.890000    456.000000
std        288.819436    13.68143     1.132734      189.681356    559.997632
min          1.000000    18.00000     1.000000       25.000000     25.000000
25%        250.750000    29.00000     1.000000       30.000000     60.000000
50%        500.500000    42.00000     3.000000       50.000000    135.000000
75%        750.250000    53.00000     4.000000      300.000000    900.000000
max       1000.000000    64.00000     4.000000      500.000000   2000.000000

In [8]:
# check for missing value
df.isna().sum()

Transaction ID      0
Date                0
Customer ID         0
Gender              0
Age                 0
Product Category    0
Quantity            0
Price per Unit      0
Total Amount        0
dtype: int64

No missing values in the dataset

In [9]:
# check for duplicates
df.duplicated().sum()

0

Absence of duplicates in the dataset

In [10]:
df.columns

Index(['Transaction ID', 'Date', 'Customer ID', 'Gender', 'Age',
       'Product Category', 'Quantity', 'Price per Unit', 'Total Amount'],
      dtype='object')

In [11]:
df['Product Category'].unique()

array(['Beauty', 'Clothing', 'Electronics'], dtype=object)

In [12]:
df['Price per Unit'].unique()

array([ 50, 500,  30,  25, 300], dtype=int64)

In [13]:
df['Age'].unique()

array([34, 26, 50, 37, 30, 45, 46, 63, 52, 23, 35, 22, 64, 42, 19, 27, 47,
       62, 18, 49, 28, 38, 43, 39, 44, 51, 58, 48, 55, 20, 40, 54, 36, 31,
       21, 57, 25, 56, 29, 61, 32, 41, 59, 60, 33, 53, 24], dtype=int64)

#### Data Cleaning and Manipulation

In [14]:
# converting the Date column from object to datetime datatype

df['Date']=pd.to_datetime(df['Date'], errors='coerce')

In [15]:
df.dtypes

Transaction ID               int64
Date                datetime64[ns]
Customer ID                 object
Gender                      object
Age                          int64
Product Category            object
Quantity                     int64
Price per Unit               int64
Total Amount                 int64
dtype: object

**Age Grouping**

In [16]:
bins =[15, 22, 30, 40, 55, 65]
labels=['Students (16-22)', 'Young Professionals (23-30)', 'Settled Adults (31-40)', 'Mature Adults (41-55)', 'Seniors (56-65)']
df['Age_Group']=pd.cut(df['Age'], bins=bins, labels=labels, right=False)

In [17]:
df.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Age_Group
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150,Settled Adults (31-40)
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000,Young Professionals (23-30)
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30,Mature Adults (41-55)
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500,Settled Adults (31-40)
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100,Settled Adults (31-40)

In [18]:
# dropping irrelevant columns
df.drop(['Transaction ID', 'Age'], axis=1, inplace=True)

In [19]:
df.head()

,Date,Customer ID,Gender,Product Category,Quantity,Price per Unit,Total Amount,Age_Group
0,2023-11-24,CUST001,Male,Beauty,3,50,150,Settled Adults (31-40)
1,2023-02-27,CUST002,Female,Clothing,2,500,1000,Young Professionals (23-30)
2,2023-01-13,CUST003,Male,Electronics,1,30,30,Mature Adults (41-55)
3,2023-05-21,CUST004,Male,Clothing,1,500,500,Settled Adults (31-40)
4,2023-05-06,CUST005,Male,Beauty,2,50,100,Settled Adults (31-40)